khoih-prog/Blynk_Esp8266AT_WM/src/BlynkSimpleShieldEsp8266_Teensy_WM.h
    void begin(const char* d,  uint16_t p) {
        domain = d;
        port = p;
    }

    bool connect() {
        if (!domain || !port)
            return false;
        status = client->createTCP(BLYNK_ESP8266_MUX, domain, port);
        return status;
    }

    void disconnect() {
        status = false;
        buffer.clear();
        client->releaseTCP(BLYNK_ESP8266_MUX);
    }

    size_t read(void* buf, size_t len) 
    {
        millis_time_t start = BlynkMillis();
        //KH
        //buffer.size() is number of bytes currently still in FIFO buffer
        //Check to see if all data are read or not
        
        #if (SIMPLE_SHIELD_ESP8266_DEBUG > 1)
          BLYNK_LOG4("read: Data len: ", len, " Buffer: ", buffer.size());
        #endif
        
        while ((buffer.size() < len) && (BlynkMillis() - start < 1500)) 
        {
            // Actually call ESP8266 run/rx_empty (read and locate +IPD, know data len, 
            // then call onData() to get len bytes of data to buffer => BlynkProtocol::ProcessInput()
            client->run();
        }
        //KH Mod
        #if 0
        // Check to see if got sequence [14|0D|0A]+IPD,<id>,<len>:<data> => discard until end of <data>
        
        /*static*/ uint8_t tempBuff[128];
        if (len < sizeof(tempBuff))
        {
          buffer.get(tempBuff, len);
          //tempBuff[len] = 0;
        }
        
        char testString1[5] = { 0x0D, 0x0A, '+', 'I', 0};
        char testString2[6] = { '+', 'I', 'P', 'D', ',', 0 };
        char testString3[3] = { 'P', 'D', 0 };
        char testString4[3] = { 0x0D, 0x0A, 0 };
        
        /*static*/ uint8_t localBuff[128];
        /*static*/ unsigned int localLength;
        /*static*/ unsigned int copyLength;
        
        /*+IPD,<id>,<len>:<data>*/
        if ( strstr((char*) tempBuff, testString1) /*|| strstr((char*) tempBuff, testString2) || strstr((char*) tempBuff, testString3)*/ )
        {
          //Got +I, next => PD,<id>,<len>:<data>
          //                012  3 4  5  6  7
          BLYNK_LOG2("read: Bad sequence a ", (char*) tempBuff);
          // Read and discard more
          if (buffer.size() < sizeof(tempBuff))
          {
            buffer.get(tempBuff, buffer.size());
            
            if ( (tempBuff[0] == 'P') && (tempBuff[1] == 'D') && (tempBuff[2] == ',') /*&& (tempBuff[3] == '1') && (tempBuff[4] == ',')*/ )
            {
              BLYNK_LOG2("read: Bad sequence2 ", (char*) tempBuff);
              localLength = tempBuff[5];
              copyLength = localLength < sizeof(localBuff)? localLength : sizeof(localBuff);
              memcpy(localBuff, tempBuff + 7, copyLength );
              memcpy(tempBuff, localBuff, copyLength);
              BLYNK_LOG2("read: Bad sequence3 ", (char*) tempBuff);
              return copyLength;
            }
          }
          
          return 0;
        }
        else if ( strstr((char*) tempBuff, testString2) /*|| strstr((char*) tempBuff, testString3)*/ )
        {
          //Got +IPD, next => <id>,<len>:<data>
          //                    0 1  2  3  4
          BLYNK_LOG2("read: Bad sequence b ", (char*) tempBuff);
          // Read and discard more
          if (buffer.size() < sizeof(tempBuff))
          {
            buffer.get(tempBuff, buffer.size());
            
            if ( (tempBuff[1] == ',') && (tempBuff[3] == ':') )
            {
              BLYNK_LOG2("read: Bad sequence4 ", (char*) tempBuff);
              localLength = tempBuff[2];
              copyLength = localLength < sizeof(localBuff)? localLength : sizeof(localBuff);
              memcpy(localBuff, tempBuff + 4, copyLength );
              memcpy(tempBuff, localBuff, copyLength);
              BLYNK_LOG2("read: Bad sequence5 ", (char*) tempBuff);
              return copyLength;
            }
          }
          
          return 0;
        }     
        else if ( strstr((char*) tempBuff, testString4) /*|| strstr((char*) tempBuff, testString3)*/ )
        {
          //Got X X X 0x0D, 0x0A, next +IPD, just discard this 5 bytes
          //    0 1 2  3     4
          BLYNK_LOG2("read: Bad sequence c ", (char*) tempBuff);
          // Read and discard more
          if (buffer.size() < sizeof(tempBuff))
          {
            buffer.get(tempBuff, buffer.size());
            
            //if ( (tempBuff[1] == ',') && (tempBuff[3] == ':') )
            {
              //BLYNK_LOG2("read: Bad sequence4 ", (char*) tempBuff);
              //localLength = tempBuff[2];
              //copyLength = localLength < sizeof(localBuff)? localLength : sizeof(localBuff);
              memcpy(localBuff, tempBuff + 5, sizeof(tempBuff) - 5 );
              memcpy(tempBuff, localBuff, sizeof(tempBuff) - 5);
              BLYNK_LOG2("read: Bad sequence5 ", (char*) tempBuff);
              return 0;
            }
          }
          
          return 0;
        }                
        else
        {
          memcpy(buf, tempBuff, len);
          return len;
        }
        
        #else
        //All data got in FIFO buffer, copy to destination buf and return len
        return buffer.get((uint8_t*)buf, len);
        #endif
    }
    
    size_t write(const void* buf, size_t len) {
        if (client->send(BLYNK_ESP8266_MUX, (const uint8_t*)buf, len)) {
            return len;
        }
        return 0;
    }

    bool connected() { return status; }

    int available() 
    {
        client->run();
        #if (SIMPLE_SHIELD_ESP8266_DEBUG > 2)
          BLYNK_LOG2("Still: ", buffer.size());
        #endif
        return buffer.size();
    }

private:
    ESP8266* client;
    bool status;
    
    //KH   
    #ifdef CORE_TEENSY
      #if defined(__IMXRT1062__)
      // For Teensy 4.0
        BlynkFifo<uint8_t, 4096> buffer;
        #warning Board Teensy 4.0 uses 4k FIFO buffer        
      #elif ( defined(__MKL26Z64__) || defined(ARDUINO_ARCH_AVR) )
        // For Teensy LC and 2.0       
        BlynkFifo<uint8_t, 512> buffer;
        #warning Teensy LC and 2.0 uses 512bytes FIFO buffer        
      #else
        // For Teensy 3.x
        BlynkFifo<uint8_t, 2048> buffer;
        #warning Teensy 3.x uses 2k FIFO buffer
      #endif
    #else
      // For other AVR Mega
      BlynkFifo<uint8_t,256> buffer;
      #warning Not Teensy board => uses 256bytes FIFO buffer    
    #endif
    
    const char* domain;
    uint16_t    port;
};

class BlynkWifi
    : public BlynkProtocol<BlynkTransportShieldEsp8266>
{
    typedef BlynkProtocol<BlynkTransportShieldEsp8266> Base;
public:
    BlynkWifi(BlynkTransportShieldEsp8266& transp)
        : Base(transp)
        , wifi(NULL)
    {}


    bool WiFiInit()
    {
        if (!wifi->restart()) {
            BLYNK_LOG1(BLYNK_F("Fail2Restart"));
            return false;
        }

        if (!wifi->kick()) 
        {
             BLYNK_LOG1(BLYNK_F("ESP is not responding"));
             //TODO: BLYNK_LOG_TROUBLE(BLYNK_F("esp8266-not-responding"));
             return false;
        }
        if (!wifi->setEcho(0)) 
        {
            BLYNK_LOG1(BLYNK_F("Fail2Disable Echo"));
            return false;
        }
        
        String ver = wifi->ESP8266::getVersion();
        BLYNK_LOG1(ver);
                   
