khoih-prog/Blynk_Esp8266AT_WM/src/BlynkSimpleShieldEsp8266_Teensy_WM.h
				      if (connect())
				      {
					      BLYNK_LOG1(BLYNK_F("run: WiFi+Blynk reconnected"));
					    }
				    }
			    }
			    else
			    {
				    BLYNK_LOG1(BLYNK_F("run: Blynk lost. Connect Blynk"));
				    if (connect()) 
				    {
					    BLYNK_LOG1(BLYNK_F("run: Blynk reconnected"));
				    }
			    }
					
			    //BLYNK_LOG1(BLYNK_F("run: Lost connection => configMode"));
			    //startConfigurationMode();
        }
      }
      else if (configuration_mode)
      {
      	configuration_mode = false;
      	BLYNK_LOG1(BLYNK_F("run: got WiFi+Blynk back, great"));
      }

      if (connected())
      {
        Base::run();
      }
    }

		void setConfigPortalIP(IPAddress portalIP = IPAddress(192, 168, 4, 1))
		{
			portal_apIP = portalIP;
		}
		
		void setConfigPortal(String ssid = "", String pass = "")
		{
			portal_ssid = ssid;
			portal_pass = pass;
		}		

    void setSTAStaticIPConfig(IPAddress ip, IPAddress gw, IPAddress sn = IPAddress(255, 255, 255, 0), 
                              IPAddress dns_address_1 = IPAddress(0, 0, 0, 0), 
                              IPAddress dns_address_2 = IPAddress(0, 0, 0, 0))
    {
      static_IP     = ip;
      static_GW     = gw;
      static_SN     = sn;
      
      // Default to local GW
      if (dns_address_1 == IPAddress(0, 0, 0, 0))
        static_DNS1   = gw;
      else
        static_DNS1   = dns_address_1;
        
      // Default to Google DNS (8, 8, 8, 8)  
      if (dns_address_2 == IPAddress(0, 0, 0, 0))
        static_DNS2   = IPAddress(8, 8, 8, 8);
      else
        static_DNS2   = dns_address_2;
    }
    
    String getServerName()
    {
      if (!hadConfigData)
        getConfigData();

      return (String(Blynk8266_WM_config.blynk_server));
    }
                       
    String getToken()
    {
      if (!hadConfigData)
        getConfigData();
            
      return (String(Blynk8266_WM_config.blynk_token));
    }
        
    String getBoardName()
    {
      if (!hadConfigData)
        getConfigData();

      return (String(Blynk8266_WM_config.board_name));
    }
    
    int getHWPort()
    {
      if (!hadConfigData)
        getConfigData();

      return (Blynk8266_WM_config.blynk_port);
    }    
          
    Blynk_WF_Configuration* getFullConfigData(Blynk_WF_Configuration *configData)
    {
      if (!hadConfigData)
        getConfigData();
        
      // Check if NULL pointer
      if (configData)
        memcpy(configData, &Blynk8266_WM_config, sizeof(Blynk_WF_Configuration));

      return (configData);
    }

    String getLocalIP(void)
    {     
      uint16_t indexNextLine;
      
      ipAddress = wifi->getLocalIP().replace("+CIFSR:STAIP,\"", "");
      ipAddress = ipAddress.replace("\"", "");
      indexNextLine = ipAddress.indexOf("\n");
      ipAddress = ipAddress.substring(0, indexNextLine);
      
      //BLYNK_LOG2(BLYNK_F("getLocalIP: IP = "), ipAddress);
      return ipAddress;
    }
    
    void resetFunc()
    {
      SCB_AIRCR = 0x05FA0004; //write value for restart for Teensy
    }
    
private:
    ESP8266* wifi;
    String ipAddress = "0.0.0.0";
    
    ESP8266_AT_WebServer* server;
    bool configuration_mode = false;
    
    unsigned long configTimeout;
    bool hadConfigData = false;     
    
    Blynk_WF_Configuration Blynk8266_WM_config;
    
    String macAddress = "";
    boolean wifi_connected = false;
    
    // For Config Portal, from Blynk_WM v1.0.5    
    IPAddress portal_apIP = IPAddress(192, 168, 4, 1);
    
    String portal_ssid = "";
    String portal_pass = "";
    
    // For static IP, from Blynk_WM v1.0.5
    IPAddress static_IP   = IPAddress(0, 0, 0, 0);
    IPAddress static_GW   = IPAddress(0, 0, 0, 0);
    IPAddress static_SN   = IPAddress(255, 255, 255, 0);
    IPAddress static_DNS1 = IPAddress(0, 0, 0, 0);
    IPAddress static_DNS2 = IPAddress(0, 0, 0, 0);    

		#define RFC952_HOSTNAME_MAXLEN      24
		char RFC952_hostname[RFC952_HOSTNAME_MAXLEN + 1];

		char* getRFC952_hostname(const char* iHostname)
		{ 
			memset(RFC952_hostname, 0, sizeof(RFC952_hostname));
			
			size_t len = ( RFC952_HOSTNAME_MAXLEN < strlen(iHostname) ) ? RFC952_HOSTNAME_MAXLEN : strlen(iHostname);
			
			size_t j = 0;
			
			for (size_t i = 0; i < len - 1; i++)
			{
				if ( isalnum(iHostname[i]) || iHostname[i] == '-' )
				{
				  RFC952_hostname[j] = iHostname[i];
				  j++;
				}  
			}
			// no '-' as last char
			if ( isalnum(iHostname[len - 1]) || (iHostname[len - 1] != '-') )
				RFC952_hostname[j] = iHostname[len - 1];

			return RFC952_hostname;
		}
    
		void displayConfigData(void)
		{
		    BLYNK_LOG6(BLYNK_F("Header = "), Blynk8266_WM_config.header, BLYNK_F(", SSID = "), Blynk8266_WM_config.wifi_ssid, 
                   BLYNK_F(", PW = "),   Blynk8266_WM_config.wifi_pw);
        BLYNK_LOG6(BLYNK_F("Server = "), Blynk8266_WM_config.blynk_server, BLYNK_F(", Port = "), Blynk8266_WM_config.blynk_port, 
                   BLYNK_F(", Token = "),  Blynk8266_WM_config.blynk_token);     
        BLYNK_LOG2(BLYNK_F("Board Name = "), Blynk8266_WM_config.board_name);   
		}  
		
    void displayWiFiData(void)
		{
        BLYNK_LOG2(BLYNK_F("IP = "), getLocalIP());
    }
    
    
#define BLYNK_BOARD_TYPE   "SHD_ESP8266"
#define NO_CONFIG           "nothing"

//#define EEPROM_SIZE       E2END
//#define EEPROM_SIZE       512

//KH   
// Teensy 4.0 :  EEPROM_SIZE = 3824 = (255 * 15) - 1, why 1080 ???
// Teensy++2.0, 3.5 and 3.6 : EEPROM_SIZE = 4096
// Teensy++1.0, 3.0, 3.1 and 3.2 : EEPROM_SIZE = 2048
// Teensy2.0 : EEPROM_SIZE = 1024
// Teensy1.0 : EEPROM_SIZE = 512
// Teensy LC : EEPROM_SIZE = 128

/* 
Teensy 4.0 => EEPROM_SIZE = 3824 = (255 * 15) - 1
#define FLASH_SECTORS  15
#if E2END > (255*FLASH_SECTORS-1)
#error "E2END is set larger than the maximum possible EEPROM size"
#endif
======================================================
Teensy3.x
#if defined(__MK20DX128__)      //Teensy 3.0
#define EEPROM_MAX  2048
#elif defined(__MK20DX256__)    //Teensy 3.1 and 3.2
#define EEPROM_MAX  2048
#elif defined(__MK64FX512__)    //Teensy 3.5
#define EEPROM_MAX  4096
#elif defined(__MK66FX1M0__)    //Teensy 3.6
#define EEPROM_MAX  4096
#elif defined(__MKL26Z64__)     //Teensy LC
#define EEPROM_MAX  255
#endif
======================================================
Teensy 2.x
Teensy 2.0
#if defined(__AVR_ATmega32U4__)     //Teensy 2.0
#elif defined(__AVR_AT90USB162__)   //Teensy 1.0
#elif defined(__AVR_AT90USB646__)   //Teensy++ 1.0
#elif defined(__AVR_AT90USB1286__)  //Teensy++ 2.0
*/

